Public Attributes | List of all members
API_AnalyticalReleaseType Struct Reference
Analytical Model
Describes a Structural Analytical Model Member release. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
API_Guid  | guid
The identifier of the Structural Analytical Member referenced.
GS::Array< API_AnalyticalReleaseDescription >  | releaseDescriptions
Relase settings.
Detailed Description
Describes a Structural Analytical Model Member release.
Since
Archicad 24
Member Data Documentation
◆ guid
 API_AnalyticalReleaseType::guid
The identifier of the Structural Analytical Member referenced.
◆ releaseDescriptions
 API_AnalyticalReleaseType::releaseDescriptions
Relase settings.